CFD_static_RANS/0.orig/include/initialConditions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

flowVelocity          (-20 0 0);
pressure              101325;

turbulentIntensity    0.01;
turbulentKE           0.01;

turbulentmixingLength 0.01;
turbulentOmega        0.01;

// ************************************************************************* //
