CFD_static_RANS/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/Dimensions" 

//#codeStream;

convertToMeters 1;

vertices
(
    (0		0	$Z1) //0
    ($Xmax	0	$Z1) //1
    ($Xmax	$Ymid	$Z1) //2
    ($Xmax	$Ymax	$Z1) //3
    (0		$Ymax	$Z1) //4
    ($L		$Ymax	$Z1) //5
    ($Xmin	$Ymax	$Z1) //6
    ($Xmin	$Ymid	$Z1) //7   
    ($Xmin	0	$Z1) //8
    ($L		0	$Z1) //9
    ($L		$Ymid	$Z1) //10
    (0		$Ymid	$Z1) //11

    (0		0	$Z) //12 0
    ($Xmax	0	$Z) //13 1
    ($Xmax	$Ymid	$Z) //14 2
    ($Xmax	$Ymax	$Z) //15 3
    (0		$Ymax	$Z) //16 4
    ($L		$Ymax	$Z) //17 5
    ($Xmin	$Ymax	$Z) //18 6
    ($Xmin	$Ymid	$Z) //19 7   
    ($Xmin	0	$Z) //20 8
    ($L		0	$Z) //21 9
    ($L		$Ymid	$Z) //22 10
    (0		$Ymid	$Z) //23 11
        
);

blocks
(
    hex (0 1 2 11 12 13 14 23) 	 (20 25 1) edgeGrading (50 50 50 50 1 1 1 1 1 1 1 1)
    hex (11 2 3 4 23 14 15 16)   (20 75 1) edgeGrading (50 1 1 50 50 1 1 50 1 1 1 1)
    hex (10 11 4 5 22 23 16 17)  (300 75 1) edgeGrading (1 1 1 1 50 50 50 50 1 1 1 1)
    hex (7 10 5 6 19 22 17 18) 	 (50 75 1) edgeGrading (0.02 0.02 0.02 0.02 1 50 50 1 1 1 1 1)
    hex (8 9 10 7 20 21 22 19) 	 (50 25 1) edgeGrading (0.02 0.02 0.02 0.02 1 1 1 1 1 1 1 1)


);

edges
(
);

boundary
(

    inlet
    {
        type patch;
        faces
        (
            (1 2 14 13)
            (2 3 15 14)

        );
    }
    outlet
    {
        type patch;
        faces
        (
            (7 8 20 19)
            (6 7 19 18)

        );
    }
    train
    {
        type wall;
        faces
        (
            (9 10 22 21)
            (10 11 23 22)
            (11 0 12 23)
        );
    }
    outside
    {
        type patch;
        faces
        (
            (3 4 16 15)
	    (4 5 17 16)
	    (5 6 18 17)
        );
    }
    symmetry
    {
        type symmetryPlane;
        faces
        (
            (0 1 13 12)
            (8 9 21 20)
        );
    }
    front
    {
        type empty;
        faces
        (
            (12 13 14 23)
            (14 15 16 23)
            (16 17 22 23)
            (17 18 19 22)
            (19 20 21 22)
        );
    }
    back
    {
        type empty;
        faces
        (
	    (0 1 2 11)
            (2 3 4 11)
            (4 5 10 11)
            (5 6 7 10)
            (7 8 9 10)
        );
    }
    

);


mergePatchPairs
(

);

// ************************************************************************* //
