CFD_static_RANS/system/include/Dimensions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

W			2.88;



Xmax			#calc "2*$W";
Xmin			#calc "-35*$W";
//Xmid			#calc "$W";
L			#calc "-30*$W";

Ymax			#calc "2*$W";
//Ymid			#calc "0.75*$W";
Ymid			#calc "0.5*$W";

Z			1;

Z1			#calc "-$Z";

// ************************************************************************* //
